### Задание5
### Напишите программу, которая у пользователя запрашивает одно число. Находит
### делители данного числа от 2 до 10 и выводит на экран найденные делители


```
a=int(input("введите число  :  "))

for i in range(2,10):
    if a % i == 0:
        print(i)
```
