### Задание1
### Напишите программу, которая запрашивает у пользователя три числа в диапазоне
### 1-1000. Компьютер генерирует два случайных числа в диапазоне 1-100, которые
### определяют отрезок. Определить какие числа указанные пользователям попали в
### отрезок.

```
import random

d = (int(random.randint(1,100)))
f = (int(random.randint(1,100)))
print(d,f)

if d > f:
    g=[f,d]
else:
    g=[d,f]

print(g)

aaaa = True
while aaaa:
    a = (int(input("введите первое число от 1 до 1000:    ")))
    if a >= 1 and a <= 1000:
        aaaa = False

bbbb = True
while bbbb:
    b = (int(input("введите второе число от 1 до 1000:    ")))
    if b  >= 1 and b <= 1000:
        bbbb = False

сссс = True
while сссс:
    с = (int(input("введите третье число от 1 до 1000:    ")))
    if с  >= 1 and с <= 1000:
        сссс = False

if a >=g[0] and a <= g[1]:
    print(" первое число попало в диапозон")
else:
    print("первое число не попало в диапозон")

if b >=g[0] and b <= g[1]:
    print(" второе число попало в диапозон")
else:
    print("второе число не попало в диапозон")

if с >=g[0] and с <= g[1]:
    print(" третье число попало в диапозон")
else:
    print("третье число не попало в диапозон")

```