### Задание4
### Напишите программу, в которой в бексонечном цикле пользователь вводит два числа, а программа выводит их сумму. 
### Затем программа запрашивает, надо ли завершить ввод. И если пользователь вводит
### букву "Y" или "y", то происходит выход из бесконечного цикла, и программа завершается.
### При нажатии любой другой клавиши, программа продолжает работу.

```
cccc=True
while cccc:
        a = int(input( " введите первое число"))
        b = int(input( " введите второе число"))
        print(a+b)
        g=str(input(" если хотите прекратить цикл введите Y"))
        if g == "Y" or g =="y":
            cccc=False
```