### Задание5
### Написать программу – игра - угадай, в которой с помощью функции random
### генерируется случайное число от 1 до 50 Пользователю предлагается угадать данное
### число, на основе подсказать – загаданное число больше или меньше числа пользователя.
### Вывести число попыток отгадывания числа


```
import random
a=random.randint(1,50)
caunt=0
flag=0
while flag ==0:
    n=int(input("введите число"))
    caunt = caunt+1
    if n ==a:
        flag=1
        print("Вы угадали с ", caunt)
    elif a > n:
        print("заданное число больше")
    else:
        print("загаданное число меньше")


```

