### Задача 1
### Написать программу, которая последовательно вызывает три функции.
### Функция 1 – подсчитывает для заданного отрезка чисел все числа, которые делятся нацело
### на 3, функция 2 – подсчитывает для заданного отрезка чисел все числа, которые делятся
### нацело на 4, Функция 3– подсчитывает для заданного отрезка чисел все числа, которые
### делятся нацело на 5

```
def def3(d,f):
    if d > f:
        g=[f,d]
    else:
        g=[d,f]
    list1=[]
    list1.append(g[-1])
    while g[0] < g[1]:
        g[1] = g[1]-1
        list1.append(g[1])
        list2=[]
    for i in list1:
        if i % 3 == 0:
         list2.append(i)
    print(list2)

def def4(d,f):
    if d > f:
        g=[f,d]
    else:
        g=[d,f]
    list1=[]
    list1.append(g[-1])
    while g[0] < g[1]:
        g[1] = g[1]-1
        list1.append(g[1])
        list2=[]
    for i in list1:
        if i % 4 == 0:
         list2.append(i)
    print(list2)

def def5(d,f):
    if d > f:
        g=[f,d]
    else:
        g=[d,f]
    list1=[]
    list1.append(g[-1])
    while g[0] < g[1]:
        g[1] = g[1]-1
        list1.append(g[1])
        list2=[]
    for i in list1:
        if i % 5 == 0:
         list2.append(i)
    print(list2)


def5(1,20)

[20, 15, 10, 5]

```
### Задача 2 Основная ветка программы, не считая заголовков функций, состоит из одной
### строки кода. Это вызов функции test(). В ней запрашивается на ввод целое число. Если
### оно положительное, то вызывается функция positive(), тело которой содержит команду
### вывода на экран слова "Положительное". Если число отрицательное, то вызывается
###  функция negative(), ее тело содержит выражение вывода на экран слова "Отрицательное".

```

def test(i):
    if i > 0:
        positive()
    else:
        negative()



def positive():
    print("Положительное")
def negative():
    print("Отрицательное")



test(1)

Положительное

```


### Задача 3 Напишите программу по следующему описанию.
### В основной ветке программы вызывается функция cylinder(), которая вычисляет
### площадь цилиндра.
### В теле cylinder определена функция circle, вычисляющая площадь круга по формуле πr2.
### В теле cylinder у пользователя спрашивается, хочет ли он получить только площадь
### боковой поверхности цилиндра, которая вычисляется по формуле 2πrh, или полную
### площадь цилиндра.

### У меня с моим ЦПШ нет шансов даже разобраться в условиях 


### адача 4 Дан список целых чисел. Посчитать, сколько раз в нем встречается каждое
### число. Например, если дан список [1, 1, 3, 2, 1, 3, 4], то в нем число 1 встречается три раза,
### число 3 - два раза, числа 2 и 4 - по одному разу.
